/* - 우리가 만든 영화 앱을 깃허브에 배포해 보자. 가장 먼저 해야 할 일은 깃허브 주소를 영화 앱이 인식-
 * 할 수 있도록 package.json 파일을 열어 수정하는 것이다. homepage 키와 키값을 browserlist 키 아래에
 * 추가해 주자. 깃허브 계정과 저장소 이름에 주의하여 입력하자. 
 * 이어서 package.json 파일을 열어 scripts 키값으로 명령어를 추가해 주자. 
 * 02-1에서 영화 앱을 깃허브 저장소에 업로드했었다. 같은 방법으로 최종 코드를 깃허브에 업로드하자. 
 * 다음 명령어를 입력하여 최종 완성 코드를 깃허브 저장소에 업로드하자. 
 * ->
 * git add .
 * git commit -m "최종 완성 코드"
 * git push origin master
 * 
 * 최종 완성 코드를 깃허브에 업로드했다. 이제 배포 서비스를 이용해서 다른 사람들이 영화 앱을 사용할
 * 수 있도록 해야 한다. 이 책에서는 깃허브에서 제공하는 Github Pages 서비스(무료)로 영화 앱을 배포한-
 * 다. 프로젝트 루트 폴더에서 gh-pages를 설치하자. 
 */